In [3]:
import pandas as pd
import numpy as np

In [4]:
dict = {
    "name": ['Prince', 'Jeet','HariOm','Aditya','Rajveer'],
    "Marks": [9 , 10, 12, 12, 9,],
    "City": ['Sonpur', 'Patna','Ara','Siwan','Chhapra',]
}

In [5]:
df = pd.DataFrame(dict)

In [6]:
df

      name  Marks     City
0   Prince      9   Sonpur
1     Jeet     10    Patna
2   HariOm     12      Ara
3   Aditya     12    Siwan
4  Rajveer      9  Chhapra

In [7]:
df.to_csv("Data.csv")

In [8]:
df.to_csv("Data.csv", index=False)

In [9]:
data = pd.read_csv("Data.csv")

In [10]:
data

      name  Marks     City
0   Prince      9   Sonpur
1     Jeet     10    Patna
2   HariOm     12      Ara
3   Aditya     12    Siwan
4  Rajveer      9  Chhapra

In [11]:
data.index = ['first','second','third','fourth','fifth']

In [12]:
data

           name  Marks     City
first    Prince      9   Sonpur
second     Jeet     10    Patna
third    HariOm     12      Ara
fourth   Aditya     12    Siwan
fifth   Rajveer      9  Chhapra

In [13]:
data['Marks']['first'] = 100

C:\Users\princ\AppData\Local\Temp\ipykernel_22364\1952549135.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['Marks']['first'] = 100
C:\Users\princ\AppData\Local\Temp\ipykernel_22364\1952549135.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Marks']['first'] = 100

In [14]:
data

           name  Marks     City
first    Prince    100   Sonpur
second     Jeet     10    Patna
third    HariOm     12      Ara
fourth   Aditya     12    Siwan
fifth   Rajveer      9  Chhapra

In [22]:
data.to_csv("Data2.csv")

In [25]:
ser = pd.Series(np.random.rand(55))

In [26]:
ser

0     0.344796
1     0.012753
2     0.173925
3     0.594675
4     0.008515
5     0.500912
6     0.715030
7     0.412823
8     0.605421
9     0.100969
10    0.106951
11    0.824910
12    0.637986
13    0.349867
14    0.737980
15    0.060245
16    0.898897
17    0.422493
18    0.839407
19    0.859606
20    0.805003
21    0.322784
22    0.744617
23    0.787784
24    0.626026
25    0.835314
26    0.596484
27    0.015910
28    0.803133
29    0.948521
30    0.655775
31    0.282237
32    0.259987
33    0.662325
34    0.985002
35    0.328600
36    0.224448
37    0.813820
38    0.634292
39    0.230715
40    0.188278
41    0.382662
42    0.173397
43    0.354409
44    0.395382
45    0.310394
46    0.896142
47    0.143661
48    0.829109
49    0.982676
50    0.986027
51    0.115090
52    0.950944
53    0.323004
54    0.707446
dtype: float64

In [27]:
type(ser)

pandas.core.series.Series

In [28]:
newdef = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [29]:
newdef

            0         1         2         3         4
0    0.863932  0.297362  0.330703  0.942910  0.781666
1    0.869202  0.945363  0.726626  0.576531  0.973317
2    0.864047  0.977942  0.983014  0.365888  0.725505
3    0.803311  0.988564  0.431301  0.030382  0.641868
4    0.723523  0.031567  0.405094  0.509813  0.666736
..        ...       ...       ...       ...       ...
329  0.244141  0.099893  0.005820  0.027065  0.382984
330  0.173191  0.419604  0.127966  0.676108  0.718477
331  0.924446  0.693709  0.828404  0.252502  0.054308
332  0.979893  0.122191  0.676104  0.268195  0.897901
333  0.994922  0.154187  0.665632  0.564159  0.691511

[334 rows x 5 columns]

In [34]:
newdef.head(10)

          0         1         2         3         4
0  0.863932  0.297362  0.330703  0.942910  0.781666
1  0.869202  0.945363  0.726626  0.576531  0.973317
2  0.864047  0.977942  0.983014  0.365888  0.725505
3  0.803311  0.988564  0.431301  0.030382  0.641868
4  0.723523  0.031567  0.405094  0.509813  0.666736
5  0.799251  0.336671  0.501883  0.826854  0.427484
6  0.228343  0.210446  0.186090  0.299317  0.086610
7  0.978002  0.512955  0.039788  0.540731  0.194177
8  0.156292  0.744398  0.323957  0.497661  0.466398
9  0.557912  0.639612  0.582664  0.034517  0.430259

In [35]:
newdef.tail(10)

            0         1         2         3         4
324  0.162667  0.098210  0.981734  0.904051  0.668938
325  0.028058  0.623701  0.668826  0.986782  0.762096
326  0.590179  0.335227  0.523006  0.275050  0.318722
327  0.995590  0.222162  0.262233  0.315812  0.493062
328  0.655014  0.849971  0.392460  0.473324  0.187371
329  0.244141  0.099893  0.005820  0.027065  0.382984
330  0.173191  0.419604  0.127966  0.676108  0.718477
331  0.924446  0.693709  0.828404  0.252502  0.054308
332  0.979893  0.122191  0.676104  0.268195  0.897901
333  0.994922  0.154187  0.665632  0.564159  0.691511

In [36]:
type(newdef)

pandas.core.frame.DataFrame

In [37]:
newdef.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.516825    0.506463    0.504129    0.486460    0.514677
std      0.290676    0.291304    0.288256    0.286284    0.290432
min      0.004202    0.001305    0.001790    0.009203    0.002801
25%      0.259960    0.268212    0.268392    0.255124    0.252484
50%      0.548699    0.493151    0.490894    0.475530    0.537313
75%      0.759738    0.771378    0.765968    0.719608    0.745647
max      0.999944    0.999291    0.996823    0.993497    0.998794

In [40]:
newdef.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object